lib/tasks/createTables.rake

INSERT INTO "locations" ("name", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ACME Packing"], ["city", "San Diego"], ["created_at", "2021-05-26 20:23:08.381329"], ["updated_at", "2021-05-26 20:23:08.381329"]]
---
	task :create_location => [:environment] do
		csv_text = File.read(Rails.root.join("lib", "locations.csv"))
		csv = CSV.parse(csv_text, :headers => true)
		csv.each do |row|
			t = Location.new
			t.name = row["name"]
			t.city = row["city"]
                        t.save

INSERT INTO "technicians" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Bill Keller"], ["created_at", "2021-05-26 20:23:14.033475"], ["updated_at", "2021-05-26 20:23:14.033475"]]
---
	task :create_technician => [:environment] do
		csv_text = File.read(Rails.root.join("lib", "technicians.csv"))
		csv = CSV.parse(csv_text, :headers => true)
		csv.each do |row|
			t = Technician.new
			t.name = row["name"]
                        t.save

INSERT INTO "work_orders" ("technician_id", "location_id", "time", "duration", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["technician_id", 1], ["location_id", 1], ["time", "06:00:00"], ["duration", 60], ["price", 120], ["created_at", "2021-05-26 20:23:26.943509"], ["updated_at", "2021-05-26 20:23:26.943509"]]
---
	task :create_workorder => [:environment] do
		csv_text = File.read(Rails.root.join("lib", "work_orders.csv"))
		csv = CSV.parse(csv_text, :headers => true)
		csv.each do |row|
			t = WorkOrder.new
			t.technician_id = row["technician_id"]
			t.location_id = row["location_id"]
			t.time = row["time"]
			t.duration = row["duration"]
			t.price = row["price"]
                        t.save