app/controllers/work_orders_controller.rb

  def index
  	  @work_orders = WorkOrder.all
---
SELECT "work_orders".* FROM "work_orders"