app/views/work_orders/index.html.erb

					<% if has_apt_1 == 0 %>
						<% next_job = @work_orders.find { |w| w.time.hour > i && w.technician_id == 1} %>
---
SELECT "technicians".* FROM "technicians" WHERE "technicians"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

					<% if has_apt_3 == 0 %>
						<% next_job = @work_orders.find { |w| w.time.hour > i && w.technician_id == 3} %>
---
SELECT "technicians".* FROM "technicians" WHERE "technicians"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]